# LIST Comprehension

Question : For first n natural numbers, find all distinct pair of numbers, whose product is odd

In [ ]:
# Trying to write this in form of list comprehension
n = 10
g = [(x,y) for x in range(1,n) for y in range(x+1,n) if x*y %2 != 0]
print(g)

[(1, 3), (1, 5), (1, 7), (1, 9), (3, 5), (3, 7), (3, 9), (5, 7), (5, 9), (7, 9)]

In [ ]:
 lst = [['Harry', 37.21], ['Berry', 37.21], ['Tina', 37.2], ['Akriti', 41], ['Harsh', 39]]

In [ ]:
test = []
for i in range(0,len(lst)):
  val = lst[i][1]
  test.append(val)
print(test)

[37.21, 37.21, 37.2, 41, 39]

In [ ]:

# 2-D List
matrix = [[1, 2, 3], [4, 5], [6, 7, 8, 9]]
  
# Nested List Comprehension to flatten a given 2-D matrix
flatten_matrix = [val for sublist in matrix for val in sublist]

In [ ]:
[val for i in sublist in lst ]

[39, 39, 39, 39, 39]

In [ ]:
[print(val) for sublist in lst for val in sublist]

Harry
37.21
Berry
37.21
Tina
37.2
Akriti
41
Harsh
39

[None, None, None, None, None, None, None, None, None, None]

In [ ]:
lst = [[3,1],[1,3]]

AttributeError: ignored

# Dictionary

In [ ]:
dict1 = {(3,4,8):4,(5,6,9):3}
print(dict1)

{(3, 4, 8): 4, (5, 6, 9): 3}

In [ ]:
print('output',dict1[3,4,8])

output 4

2. Get keys["name","age"] from dictionary and create new dictionary

Key, values we have to get. We are using the dictionary comprehension with IN Operatior to find the keys ['name','age']

In [ ]:
animaldict = {
"name":"Dog",
 "age":5,
 "weight":4,
 "country":"US",
 "city":"California"}

In [ ]:
outdict = {key : animaldict[key] for key in ["name","age"] }
print(outdict)

{'name': 'Dog', 'age': 5}

#3. Program to delete set of keys from dictionary 

Keys to delete = ['name','age']

In [ ]:
outdict = {key :animaldict[key] for key in animaldict.keys() - ["name","age"]}
print(outdict)

{'country': 'US', 'weight': 4, 'city': 'California'}

In [ ]:
#What will be the output of the program 
dictlang = {'c#':6, 'GO':89,'Python':4,"Rust":10}
print(sorted(dictlang))
for _ in sorted(dictlang):
  print(dictlang[_])

['GO', 'Python', 'Rust', 'c#']
89
4
10
6

Here, we are checking coping one dictionary to another dictionary has the same ID. It will return true of False

In [ ]:
cpydict = dictlang.copy()
print(id(cpydict))
print(id(dictlang))
print(id(cpydict) == id(dictlang))

139913295337664
139913295514192
False

How to change Names in dictionary

In [ ]:
animaldict['animalname'] = animaldict.pop('name')
print(animaldict)

{'age': 5, 'weight': 4, 'country': 'US', 'city': 'California', 'animalname': 'Dog'}

In [ ]:
print(dictlang['c#','GO'])

KeyError: ignored

How to change the value of any key in nested dictionary

In [ ]:
animaldict = {
    "animal" :{
        "name" :'Dog',
        "age" :5
    },
    "animal1" : {
        "name" : "cat",
        "age":2
    },
    "animal2" : {
        "name":"Rabbit",
        "age": 1
    },
}

In [ ]:
animaldict

{'animal': {'age': 5, 'name': 'Dog'},
 'animal1': {'age': 2, 'name': 'cat'},
 'animal2': {'age': 1, 'name': 'Rabbit'}}

In [ ]:
#change name of catin nested animal1
animaldict["animal1"]["age"] = 5

In [ ]:
animaldict

{'animal': {'age': 5, 'name': 'Dog'},
 'animal1': {'age': 5, 'name': 'cat'},
 'animal2': {'age': 1, 'name': 'Rabbit'}}

delete a key from dictionary

In [ ]:
fruitsdict = { 
    "Apple" : 100,
    "Orange" : 200,
    "Banana" : 400,
    "pomegranate":600
}
#if 'Apple' in fruitsdict:
 # del fruitsdict['Apple']

In [ ]:
fruitsdict

{'Banana': 400, 'Orange': 200, 'pomegranate': 600}

How to get min and max keys corresponding to mon and max value in the dictionary

In [ ]:
print("Min value key ", min(fruitsdict,key=fruitsdict.get))
print("Max value key",max(fruitsdict,key = fruitsdict.get))

Min value key  Apple
Max value key pomegranate

In [ ]:
print("Min value key ", min(fruitsdict))
print("Max value key",max(fruitsdict))

Min value key  Apple
Max value key pomegranate

How to concatenate multiple dictionary in one

In [ ]:
Fruit = {'Apple': 100, 'banana': 5}
Subject = {'Math': 100,'English':98}
animal = {'name': 'Rabbit','age':1}
concate_dict = {}

for dict1 in (Fruit,Subject,animal) : concate_dict.update(dict1)
print(concate_dict)

{'Apple': 100, 'banana': 5, 'Math': 100, 'English': 98, 'name': 'Rabbit', 'age': 1}

Using the sum() method we can sum the Dictionary elements

In [ ]:
Fruit = {'Apple': 100,'banana':5,'orage':45,'guava':60}
print("Sum of dict elements", sum(Fruit.values()))

Sum of dict elements 210

how to multiply all elements of dictionary

In [ ]:
multi = 1
for key in Fruit:
  multi += multi * Fruit[key]

print(multi)

1700436

How to sort a Dictionary by key

In [ ]:
print("Sorted Dictionary:")
for key in sorted(Fruit):
  print(key,":",Fruit[key])

Sorted Dictionary:
Apple : 100
banana : 5
guava : 60
orage : 45

How to remove no value items from Dictionary

In [ ]:
mutidict = {'lang': 'C#','Fruit':'Apple','Subj':None,'Animal': None}
Outdict = {Key:value for (Key,value) in mutidict.items() if value is not None}
print(Outdict)

{'lang': 'C#', 'Fruit': 'Apple'}

How to filter dictionary based on value

In [ ]:
empdict = {'jack': 12000,'Max':20000,'Hack':25000,'Nack':80000}
filterEmpDict = {key:value for (key,value) in empdict.items() if value<= 70000}

In [ ]:
filterEmpDict

{'Hack': 25000, 'Max': 20000, 'jack': 12000}

How to check number of keys have same value.

In [ ]:
empdict = {'Racx':12000,'Max':80000,'Stack':80000,'John':80000,}

valuetofind = 80000

count = sum(val == valuetofind for val in empdict.values())

print("number of keys have same value",count)

number of keys have same value 3

How to convert dictionary object into string

In [ ]:
personDict = {'Name':'Simulen',
              'City': 'CA',
              'Country':'USA'}
print("Type before conversion =",type(personDict))

dicttostring = str(personDict)
print(dicttostring)

Type before conversion = <class 'dict'>
{'Name': 'Simulen', 'City': 'CA', 'Country': 'USA'}

Program to add multiple keys into dictionary

In [ ]:
persondict = {'person':{"name":'Simulat',
                        "city":"CA",
                        "country":'USA'},
             'person1':{"name":'gogo',
                        "city":"Ct",
                        "country":'UK'}, }

persondict['person']['Company'] = 'Morgan Stanley'

print("Dictionary after adding key =\n",persondict)

Dictionary after adding key =
 {'person': {'name': 'Simulat', 'city': 'CA', 'country': 'USA', 'Company': 'Morgan Stanley'}, 'person1': {'name': 'gogo', 'city': 'Ct', 'country': 'UK'}}

In [ ]:
persondict['person1']['Company'] = 'Credit Suisse'
persondict

{'person': {'Company': 'Morgan Stanley',
  'city': 'CA',
  'country': 'USA',
  'name': 'Simulat'},
 'person1': {'Company': 'Credit Suisse',
  'city': 'Ct',
  'country': 'UK',
  'name': 'gogo'}}

# Map()

source : https://www.guru99.com/python-map-function.html

Python map() applies a function on all the items of an iterator given as input. 

An iterator, for example, can be a list, a tuple, a set, a dictionary, a string, and it returns an iterable map object.

Python map() is a built-in function

```
Syntax
map(function,iterator1,iterator2....iteratorN)
```
Here are two important **Parameters**: 

- **Function** : A mandatory function to be given to map, that will be applied to all the items available in the iterator. 

- **Iterator** : An iterable compulsory object. It can be a list, a tuple, etc. 
You can pass multiple iterator objects to map() function.

**Return Value**

The map() function is going to apply the given function on all the items inside the iterator and return an iterable map object i.e a tuple, a list ,etc

1. Consider you have a list of numbers , and you want to find the square of each of the numbers.

In [ ]:
def square(n):
  return n*n

my_list = [ 2,3,4,5,6,7,8,9]
updatelist = map(square,my_list)
print(updatelist)
print(list(updatelist))

<map object at 0x7fe5d393ae50>
[4, 9, 16, 25, 36, 49, 64, 81]

The outper of the map() function ,as seen in the output, is a map object displayed in the screen.

Using map() with python built-in functions

In [ ]:
my_list = [2.6743,3.63526,4.2325,5.9687967,6.3265,7.6988,8.232,9.6907]
updated_list = map(round,my_list)
print(list(updated_list))

[3, 4, 4, 6, 6, 8, 8, 10]

The round() function is applied to all the items in the list, and it returns back with all values rounded.

Using Map() with a string as an iterator

In [ ]:
def myMapfunc(s):
  return s.upper()
my_str = 'welcome to guru99 tutorials'
update_str = map(myMapfunc,my_str)
print(update_str)
for i in update_str:
  print(i,end="")

<map object at 0x7fe5d3883790>
WELCOME TO GURU99 TUTORIALS

Using map() with list of numbers

In [ ]:
def mymapfunc(n):
  return n*10

my_list = [2,3,4,5,6,7,8,9]
updated_list = map(mymapfunc,my_list)
print(list(updated_list))

[20, 30, 40, 50, 60, 70, 80, 90]

using Map() with tuple

A tuple is an object in Python that has items seperated by commas and enclosed in round brackets. In the example, we will take a tuple with string values.

The function that we will use will convert the values given to uppercase.

In [ ]:
def mymapfunc(n):
  return n.upper()

my_tuple = ('php','java','python','c++','c')
updated_list = map(mymapfunc,my_tuple)
print(list(updated_list))

['PHP', 'JAVA', 'PYTHON', 'C++', 'C']

Using Map() with Dictionary 

A dictionary in Python is created using curly brackets({}). Since the dictionary is an iterator, you can make use of it inside map function,

In [ ]:
def mymapfunc(n):
  return n*10

my_dict = {2,3,4,5,6,7,8,9}
updated_list = map(mymapfunc,my_dict)
print(list(updated_list))

[20, 30, 40, 50, 60, 70, 80, 90]

Using Multiple Iterators inside Map() function 

You can send more than one iterator ie. a list, a tuple, etc all at the ame time to the map() function 

For example, if you want to add two lists. The same can be done using the map() function. We are going to make use of two lists my_list1 and my_list2

In [ ]:
def myMapFunc(list1,list2):
  return list1 + list2

my_list1 = [2,3,4,5,6,7,8,9]
my_list2 = [4,8,12,16,20,24,28]

updated_list = map(myMapFunc,my_list1,my_list2)
print(updated_list)
print(list(updated_list))

<map object at 0x7fe5d3885d10>
[6, 11, 16, 21, 26, 31, 36]

Passing one Tuple and a list iterator to map()

In [ ]:
def myMapFunction(list1,tuple1):
  return list1+"_"+tuple1

my_list = ['a','b', 'b', 'd', 'e']
my_tuple = ('PHP','Java','Python','C++','C')

updated_list = map(myMapFunction,my_list,my_tuple)
print(updated_list)
print(list(updated_list))

<map object at 0x7fe5d38a0c10>
['a_PHP', 'b_Java', 'b_Python', 'd_C++', 'e_C']

# Lambda Functions

A **Lambda Function in Python** programming is an anonymous function or a function having no name.
It is a small and restricted function having no more than one line.
Just like a normal function, a Lambda function can have multiple arguments with one expression

In Python, lambda expression ( or lambda forms) are utilized to construct anonymous functions. 

**3 Essential parts**

1. The lambda keyword
2. The parameters ( or bound variables), and 
3. The function body.

A Lambda function can have any number of parameters, but the function body can only contain **one** expression. Moreover, a lambda is written in a single line of code and can also be invoked immediately. 

Syntax
```
lambda p1,p2 : expression
```

Here, p1 and p2 are the parameters which are passed to the lambda function.  You can add as many or few parameters as you need.

In [ ]:
adder = lambda x,y : x+y
print(adder(1,2))

3

Using lambdas with Python built-ins

Lambda functions provide an elegant and powerful way to perform operations using built-in methods in Python.

lambdas with filter()

The filter function is used to select some particular elements from a sequence of elements. The sequence can be any iterator like ists, sets, tuples 

The elements which will be selected is based on some pre-defined constraints. 
It takes 2 parameters 

- A function that defines the filtering constraint.
- A sequence ( any iterator like lists,tuples, etc.)

In [ ]:
sequences = [10,2,8,7,5,4,3,11,0,1]
filtered_result = filter ( lambda x: x>4,sequences)
print(list(filtered_result))

[10, 8, 7, 5, 11]

lambdas in Map()

The map function is used to apply a particular operation to every elements in a sequence. Like filter(), it also takes 2 parameters. 

1. Function
2. ONe of more sequences

In [ ]:
sequences = [10,2,8,7,5,4,3,11,0,1]
filtered_result = map(lambda x : x*x,sequences)
print(list(filtered_result))

[100, 4, 64, 49, 25, 16, 9, 121, 0, 1]

# Pandas

How to fill nan values in pandas with zero

Replace() : it can be used to replace 'string','regx','dictionary','list'

In [ ]:
import pandas as pd
import numpy as np

Student_dict = {
    "Name" : ['Jack','Rack',np.nan],
    "Marks" :[ 100.5,np.nan,np.nan],
    'Subject' : [np.nan,'Math','Music']
}

In [ ]:
dfobj = pd.DataFrame(Student_dict)

dfobj['Marks'] = dfobj['Marks'].fillna(0)
print(dfobj)

   Name  Marks Subject
0  Jack  100.5     NaN
1  Rack    0.0    Math
2   NaN    0.0   Music

In [ ]:
# While df
df = dfobj.fillna(0)
print(df)

   Name  Marks Subject
0  Jack  100.5       0
1  Rack    0.0    Math
2     0    0.0   Music

Replace() Method

In [ ]:
#single column 
dfobj['Marks'] = dfobj['Marks'].replace(np.nan,0)
print(dfobj)

   Name  Marks Subject
0  Jack  100.5     NaN
1  Rack    0.0    Math
2   NaN    0.0   Music

In [ ]:
df = dfobj.replace(np.nan,0)
print(df)

   Name  Marks Subject
0  Jack  100.5       0
1  Rack    0.0    Math
2     0    0.0   Music

How to replace nan value with custom value

In [ ]:

Student_dict = {
    "Name" : ['Jack','Rack',np.nan],
    "Marks" :[ 100.5,np.nan,np.nan],
    'Subject' : [np.nan,'Math','Music']
}
dfobj = pd.DataFrame(Student_dict)

dfobj['Name'].fillna('Max',inplace=True)

print(dfobj.iloc[0:3,0])

0    Jack
1    Rack
2     Max
Name: Name, dtype: object

How to filter data in pandas 

- isin()
- logical operator()
- str()
-Tilde(~)
-Query
-Nlargest or nsmallest
-iloc or loc

In [ ]:
import pandas as pd

Student_dict = {
    'Name': ['Jack','Rack','Max'],
    'Marks':[70,80,100],
    'Subj' :['Math','Math','Music']
}

dfobj = pd.DataFrame(Student_dict)

#logical Operator

dflog = dfobj[(dfobj.Marks > 70)& (dfobj.Subj == 'Math')]
print('\n logical:\n',dflog)

#isin()

dfisin = dfobj[dfobj.Name.isin(['Max'])]
print('\n Isin:\n',dfisin)

#str

dfstr = dfobj[dfobj.Name.str.startswith('J')]
print('\n str:\n',dfstr)


#Tilde: not

dftilde = dfobj[~dfobj.Name.str.startswith('J')]
print('\n Tilde:\n',dftilde)

#Query

dfquery = dfobj.query('Marks> 80 and Subj=="Music"')
print('\n Query:\n',dfquery)

 logical:
    Name  Marks  Subj
1  Rack     80  Math

 Isin:
   Name  Marks   Subj
2  Max    100  Music

 str:
    Name  Marks  Subj
0  Jack     70  Math

 Tilde:
    Name  Marks   Subj
1  Rack     80   Math
2   Max    100  Music

 Query:
   Name  Marks   Subj
2  Max    100  Music

how to filter null values in pandas dataframe

Find rows and columns with missing values we will use isnull() function that creates a boolean series of True for nan or missing values.

In [ ]:
Student_dict = {
    'Name': [np.nan, 'Rack', 'Max'],
    'Marks':[70,80, 100],
    'Subj': ['Math', 'Math', np.nan]
}

dfobj = pd.DataFrame(Student_dict)

#columns with missing values 
print("Column with missing values :\n",dfobj.isnull().any())

Column with missing values :
 Name      True
Marks    False
Subj      True
dtype: bool

In [ ]:
# rows with missing values 
print("Rows with missing values \n",dfobj.isnull().any(axis=1))

Rows with missing values
 0     True
1    False
2     True
dtype: bool

how to filter not null values in pandas dataframe 

notnull() : This method creates a boolean series of False for missing values (NAN)

In [ ]:
Student_dict = {
    'Name': [np.nan, 'Rack', 'Max'],
    'Marks':[70,80, 100],
    'Subj': ['Math', 'Math', np.nan]
}
  
 
dfobj = pd.DataFrame(Student_dict)

In [ ]:
print(dfobj.notnull())

    Name  Marks   Subj
0  False   True   True
1   True   True   True
2   True   True  False

How to filter not null values of dataframe column

In [ ]:
Student_dict = {
    'Name': [np.nan, 'Rack', 'Max'],
    'Marks':[70,80, 100],
    'Subj': ['Math', 'Math', np.nan]
}
  
 
dfobj = pd.DataFrame(Student_dict)

In [ ]:
print(dfobj["Subj"][pd.notnull(dfobj['Subj'])])

0    Math
1    Math
Name: Subj, dtype: object

How to filter dataframe rows withhout Nan specified column using isna()

In [ ]:
Student_dict = {
    'Name': [np.nan, 'Rack', 'Max'],
    'Marks':[70,80, 100],
    'Subj': ['Math', 'Math', 'Music']
}
  
 
dfobj = pd.DataFrame(Student_dict)

In [ ]:
# Rows without nan/missing values
print(dfobj[~dfobj['Name'].isna()])

   Name  Marks   Subj
1  Rack     80   Math
2   Max    100  Music

How to filter dataframe by indexes single or multiple

In [ ]:
Student_dict = {
    'Name': ['Jack', 'Rack', 'Max'],
    'Marks':[70,80,100],
    'Subj': ['Math', 'Math', 'Music']
}
  
 
dfobj = pd.DataFrame(Student_dict)

In [ ]:
# single row 

df_one = dfobj.filter(items = [1],axis=0)
print(df_one,"\n")
#multiple_rows
df_muti = dfobj.filter(items = [0,1],axis=0)
print(df_muti)

   Name  Marks  Subj
1  Rack     80  Math

   Name  Marks  Subj
0  Jack     70  Math
1  Rack     80  Math

How to filter dataframe based on no-numeric index

In [ ]:
 
Student_dict = {
    'Name': ['Jack', 'Rack', 'Max'],
    'Marks':[70,80,100],
    'Subj': ['Math', 'Math', 'Music']
}

dfobj = pd.DataFrame(Student_dict,index=['Row_1','Row_2','Row_3'])

#single row 

df_one = dfobj.filter(items = ['Row_2'],axis= 0 )
print(df_one)

       Name  Marks  Subj
Row_2  Rack     80  Math

How to filter dataframe with multiple columns in Pandas

In [ ]:
import pandas as pd

Student_dict = {
    'Name' : ['Jack','Rack','Max'],
    'Marks' :[100,80,100],
    'Subj':['Math','Math','Music']
}

dfobj = pd.DataFrame(Student_dict,index=['Row_1','Row_2','Row_3'])

#using query 
df_multi =dfobj.query('Marks>80 and Subj =="Math" and Name =="Jack"')

#using Eval()
df_eval = dfobj[dfobj.eval('Marks > 80 and Subj =="Math" and Name=="Jack"')]

#using logical operator
df_log = dfobj[(dfobj["Name"]=="Jack") & (dfobj["Subj"]=="Math")]


#using loc
df_loc = dfobj.loc[(dfobj["Name"].str.startswith("J")* dfobj["Subj"]=="Math")]

print("\n",df_multi)
print("\n",df_eval)
print("\n",df_log)
print("\n",df_loc)

        Name  Marks  Subj
Row_1  Jack    100  Math

        Name  Marks  Subj
Row_1  Jack    100  Math

        Name  Marks  Subj
Row_1  Jack    100  Math

        Name  Marks  Subj
Row_1  Jack    100  Math

How to filter Pandas DataFrame by Column Values

In [ ]:
options = ['Math','Music']

df_loc = dfobj.loc[(dfobj["Name"].str.startswith("J") & (dfobj["Subj"]=="Math")) & (dfobj["Marks"]==100)]

#using isin 
df_isin = dfobj[dfobj["Subj"].isin(options)]

print('\n isin:\n',df_isin)

print('\nloc:\n',df_loc)

 isin:
        Name  Marks   Subj
Row_1  Jack    100   Math
Row_2  Rack     80   Math
Row_3   Max    100  Music

loc:
        Name  Marks  Subj
Row_1  Jack    100  Math

How to Slice a dataframe by using loc

In [ ]:
dfobj = pd.DataFrame(Student_dict)

#using loc 1,2 rows for 'Name' column 

df_loc1 = dfobj.loc[0:1,"Name"]
print(df_loc1)

0    Jack
1    Rack
Name: Name, dtype: object

In [ ]:
import random
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import seaborn as sns
import random
import matplotlib.pyplot as plt

%cd /content/drive/My\ Drive/colab_notebooks/machine_learning/Interview_prep/Python/

/content/drive/My Drive/colab_notebooks/machine_learning/Interview_prep/Python

In [ ]:
import pandas as pd
nba = pd.read_csv('nba.csv')

In [ ]:
data_top  = nba.head()
data_top

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [ ]:
n = 9
series = nba['Name']
top = series.head(n=n)
top

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
8     Terry Rozier
Name: Name, dtype: object

In [ ]:
#rmoving null values to avoid errors 
nba.dropna(inplace=True)

#percentile list
perc = [.20,.40,.60,.80]

#list of dtypes to include 
include = [ 'object','float','int']
desc = nba.describe(percentiles=perc, include = include)
desc

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,364,364,364.000000,364,364.000000,364,364.000000,364,3.640000e+02
unique,364,30,NaN,5,NaN,17,NaN,115,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,16,NaN,87,NaN,49,NaN,22,NaN
mean,NaN,NaN,16.829670,NaN,26.615385,NaN,219.785714,NaN,4.620311e+06
std,NaN,NaN,14.994162,NaN,4.233591,NaN,24.793099,NaN,5.119716e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,5.572200e+04
20%,NaN,NaN,4.000000,NaN,23.000000,NaN,195.000000,NaN,9.472760e+05
40%,NaN,NaN,9.000000,NaN,25.000000,NaN,212.000000,NaN,1.638754e+06
50%,NaN,NaN,12.000000,NaN,26.000000,NaN,220.000000,NaN,2.515440e+06
60%,NaN,NaN,17.000000,NaN,27.000000,NaN,228.000000,NaN,3.429934e+06
80%,NaN,NaN,30.000000,NaN,30.000000,NaN,242.400000,NaN,7.838202e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,279.000000,NaN,2.287500e+07

https://www.geeksforgeeks.org/pandas-groupby/

Groupby is a pretty simple concept. We can create a grouping of categories and apply a function to the categories. It's a simple concept but it's an extremenly valuable technique that's widely used in data science. 
In real data science project, you'll be dealing with large amount of data and trying things over and over, so for efficiency, we use Groupby concept. Groupby concept is really important because it's ability to aggregate data effeciently both in performance and the amount code is magnificient. 

Groupy mainly refers to a process involving one or more of the following steps they are: 

1. Splitting : It is a process in which we split data into group by applying some conditions on datasets.
2. Applying : It is a process in which we apply a function to each group independently 
3. Combining : It is a process in which we combine different datasets after applying groupby and results into a data structure.

In [ ]:
import pandas as pd
  
# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1)
  
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [ ]:
df.groupby('Name')
print(df.groupby('Name').groups)

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [ ]:
# applying groupby() function to 
#group the data on Name value
gk = df.groupby('Name')
# Let's print the first entries
# in all the groups formed.
gk.first()

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

In [ ]:
#Grouping data with multiple keys: 
#In order to group data with multiple keys, 
# we pass multiple keys in groupby function  

# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}

# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1)
  
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [ ]:
#Useing multiple keys in 
#groupby() function

df.groupby(['Name','Qualification'])
print(df.groupby(['Name','Qualification']).groups)

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

In [ ]:
# importing pandas module
import pandas as pd
  
# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32], }
    
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1)
  
print(df)

     Name  Age
0     Jai   27
1    Anuj   24
2     Jai   22
3  Princi   32
4  Gaurav   33
5    Anuj   36
6  Princi   27
7    Abhi   32

In [ ]:
df.groupby(['Name']).sum()

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

Now we apply groupby () using sort in order to attain potential speedups

In [ ]:
df.groupby(['Name'],sort='False').sum()

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

Grouping Data with object Attributes: 

Groups attribute is like dictionary whose keys are the computer unique groups and corresponding values being the axis labels belonging to each group

In [ ]:
# importing pandas module
import pandas as pd
  
# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}
    
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1)
  
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [ ]:
df.groupby('Name').groups

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

Iterating through groups 

In order to iterate an element of groups, we can iterate through the object similar to itertools.obj

In [ ]:
grp = df.groupby('Name')

for name,group in grp:
  print(name)
  print(group)

Abhi
   Name  Age
7  Abhi   32
Anuj
   Name  Age
1  Anuj   24
5  Anuj   36
Gaurav
     Name  Age
4  Gaurav   33
Jai
  Name  Age
0  Jai   27
2  Jai   22
Princi
     Name  Age
3  Princi   32
6  Princi   27

Now we iterate element of group containing multiple keys

In [ ]:
# iterating an element 
# of group containing 
# multiple keys 

grp = df.groupby(['Name','Qualification'])
for name,group in grp:
  print(name)
  print(group)
  print()

('Abhi', 'MA')
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

('Anuj', 'B.com')
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com

('Anuj', 'MA')
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA

('Gaurav', 'B.Tech')
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

('Jai', 'MCA')
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

('Jai', 'Msc')
  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

('Princi', 'Msc')
     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc

('Princi', 'Phd')
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

Selecting a groups

In order to select a group , we can select using Groupby,get_group().
We can select a group by applying a function Groupby.get_group this 
function select a single group

In [ ]:
# importing pandas module
import pandas as pd
  
# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}
    
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1)
  
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [ ]:
# now we select single group using Groupby.get_group

grp = df.groupby('Name')
grp.get_group('Jai')

  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

In [ ]:
# Now we select an object grouped on multiple columns 
grp = df.groupby(['Name','Qualification'])
grp.get_group(('Jai','Msc'))

  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

**Applying Function to Group**

After splitting a data into a group, we apply a function to each group in order to do that we perform some operation they are: 

**Aggregation** : It is a process in which we compute a summary statistic ( or statistics) about each group. For example, Compute group sums or means 

**Transformation** : It is a process in which we perform some group-specific computations and return a like-indexed. For example, Filling NA's within groups with a value dervied from each group

**Filtration** : It is a process in which we discard some groups, according to a group-wise computation that evaluates True or False. For example, Filtering out data based on the group sum or mean .

In [ ]:
import numpy as np
grp1 = df.groupby('Name')
grp1.aggregate(np.sum)

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

In [ ]:
grp2 = df.groupby(['Name','Qualification'])
grp2.aggregate(np.sum)

                      Age
Name   Qualification
Abhi   MA              32
Anuj   B.com           36
       MA              24
Gaurav B.Tech          33
Jai    MCA             22
       Msc             27
Princi Msc             27
       Phd             32

**Applying multiple functions at once**

We can apply multiple functions at once by passing a list of dictionary of functions to do aggregation with , outputting a DataFrame

In [ ]:
grp = df.groupby('Name')
grp['Age'].agg([np.sum,np.mean,np.std])

        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      49  24.5  3.535534
Princi   59  29.5  3.535534

**Applying different functions to DataFrame columns**

In order to apply a different aggregation to the columns of a DataFrame, we can pass a dictionary to aggregate.

In [ ]:
# Define a dictionary containing employee data
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA'],
        'Score': [23, 34, 35, 45, 47, 50, 52, 53]}
    
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data1)
  
print(df)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

In [ ]:
grp = df.groupby('Name')
grp.agg({'Age': 'sum','Score':'std'})

        Age      Score
Name
Abhi     32        NaN
Anuj     60  11.313708
Gaurav   33        NaN
Jai      49   8.485281
Princi   59   4.949747

**Transformation:**

Transformation is a process in whic hwe perform some group-specific computations and return a like-indexed. Transform method returns an object that is indexed the same (same size) as the one being grouped. The transform function must: 

1. Return a result that is either the same size as the group chunk
2. Operate column-by-column on the group chunk
3. Not perform in-place operations on the group chunk

In [ ]:
grp = df.groupby('Name')
sc = lambda x: (x-x.mean()) /x.std() * 10
grp.transform(sc)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  This is separate from the ipykernel package so we can avoid doing imports until

        Age     Score
0  7.071068 -7.071068
1 -7.071068 -7.071068
2 -7.071068  7.071068
3  7.071068 -7.071068
4       NaN       NaN
5  7.071068  7.071068
6 -7.071068  7.071068
7       NaN       NaN

**Filtration**

Filtration is a process in which we discard some groups, according to a group-wise computation that evaluates True or False. In order to filter a group, we use filter method and apply some condition by which we filter group.

In [ ]:
grp = df.groupby('Name')
sc = lambda x : len(x)>=2
grp.filter(sc)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52

# Pandas : INNER JOIN & LEFT SEMI JOIN

An inner join requires two data set columns to be the same to fetch the common row data values or data from the data table. In simple words, and returns a data frame or values with only those rwos in the data frame that have common characteristics and behavior desired by the user. 
This is similar to the intersection of two sets in mathematics.  In short, we can say that Inner join or column ID will return columns from both the tables and only the matching records.

In [ ]:
# importing pandas as pds
import pandas as pd
  
# Creating dataframe for the data_set first
data_Set1 = pd.DataFrame()
  
# Creating data list for the table 1
# here Id 101 and 102 will be same like 
# in data set 2
schema = {'Id': [101, 102, 106, 112],
          'DATA 1': ['Abhilash', 'Raman', 'Pratap', 'James']}
data_Set1 = pd.DataFrame(schema)
  
print("Data Set-1 \n", data_Set1, "\n")
  
# Creating dataframe data_set second
data_Set2 = pd.DataFrame()

# Creating data list for the table 2
# here Id 101 and 102 will be same like 
# in data set 1
schema = {'Id': [101, 102, 109, 208],
          'DATA 2': ['Abhirav', 'Abhigyan', 'John', 'Peter']}
data_Set2 = pd.DataFrame(schema)
  
print("Data Set-2 \n", data_Set2, "\n")

Data Set-1
     Id    DATA 1
0  101  Abhilash
1  102     Raman
2  106    Pratap
3  112     James

Data Set-2
     Id    DATA 2
0  101   Abhirav
1  102  Abhigyan
2  109      John
3  208     Peter

In [ ]:
#inner join IN python 
inner_join = pd.merge(data_Set1,data_Set2,on='Id',how = 'inner')

#display dataframe
pd.DataFrame(inner_join)

    Id    DATA 1    DATA 2
0  101  Abhilash   Abhirav
1  102     Raman  Abhigyan

**Left Semi-Join**

A left semi-join requires two data set columns to be the same to fetch the data and returns all columns data or values from the left dataset, and ignores all column data values from the right dataset. In simple words, we can say that **Left Semi Join** on column Id will return columns only from the left table and matching records only from the left table.

In [ ]:
# Creating dataframe for the data_set first
data_Set1 = pd.DataFrame()
  
# Creating data list for the table 1
schema = {'Id': [101, 102, 106, 112],
     'DATA 1': ['Abhilash', 'Raman', 'Pratap', 'James']} 
data_Set1= pd.DataFrame(schema)
print(data_Set1,"\n")
  
# Creating dataframe data_set second
data_Set2 = pd.DataFrame()
  
# Creating data list for the table 2
schema2 = {'Id': [101, 102, 109, 208],
     'DATA 2': ['Abhirav', 'Abhigyan', 'John', 'Peter']}
data_Set2= pd.DataFrame(schema2)
  
print(data_Set2,"\n")

    Id    DATA 1
0  101  Abhilash
1  102     Raman
2  106    Pratap
3  112     James

    Id    DATA 2
0  101   Abhirav
1  102  Abhigyan
2  109      John
3  208     Peter

In [ ]:
#setting the base for the left semi-join in python
semi = data_Set1.merge(data_Set2,on='Id')
print(semi,"\n")
data_Set1['Id'].isin(data_Set2['Id'])
semi = data_Set1.merge(data_Set2,on='Id')

In [ ]:
new_semi = data_Set1[data_Set1['Id'].isin(semi['Id'])]
pd.DataFrame(new_semi)

    Id    DATA 1
0  101  Abhilash
1  102     Raman